# Основные запросы SELECT

### Запрос 1: Вывести идентификаторы курсов (предметов).
` SELECT CourseId FROM COURSE `
### Результат запроса 1
"1"
"2"
"3"
"4"
"5"
"6"
"7"
### Запрос 2: Вывести всю информацию о курсах (предметах).
`SELECT * FROM course`
### Результат запроса 2
"1"	"Data storage"
"2"	"Machine Learning"
"3"	"Data processing and analysis"
"4"	"Artificial intelligence"
"5"	"Image processing"
"6"	"Text processing"
"7"	"Information retrieval"


# Запросы с условием WHERE

### Запрос 3: Вывести идентификатор курса с названием "Machine Learning":
`SELECT CourseId FROM Course WHERE CourseTitle = 'Machine Learning'`
### Результат запроса 3
"2"


### Запрос 4: Вывести название курса с идентификатором 5
` SELECT CourseTitle FROM Course WHERE CourseId = 5`
### Результат запроса 4
"Image processing"

### Запрос 5: Вывести список мобильных телефонов (PhoneType = 'cell') из таблицы "PHONE_LIST".
`SELECT phone FROM phone_list WHERE phonetype = 'cell'`
### Результат запроса 5
"07106667743"
"07107534674"
"07300678543"
"07305432543"
"07911123456"
"07921126756"
"07300563775"
"07301567487"
"07303567675"
"07304767687"
"07911365676"
"07921987989"
"07922657676"
"07926765656"
"07931676657"
"07922464664"
"07931657767"
"07931233444"
"07931676776"
"07923756785"

# Агрегатные функции

### Запрос 6: Вывести количество отметок, которое получил студент с идентификатором (номером зачетки) 345576:
` SELECT count(Grade) FROM EXAM_RESULT WHERE StudentId = 345576`
### Результат запроса 6
"2"

### Запрос 7: Вывести номера зачеток (идентификаторы студентов) и средние баллы, которые получили студенты за все экзамены:
`SELECT StudentId, AVG(Grade) FROM EXAM_RESULT GROUP BY StudentId`
### Результат запроса 7
"345586"	"5.0000000000000000"
"345567"	"5.0000000000000000"
"345570"	"4.5000000000000000"
"345575"	"3.5000000000000000"
"345584"	"4.5000000000000000"
"345576"	"3.5000000000000000"
"345579"	"4.0000000000000000"
"345581"	"5.0000000000000000"
"345572"	"4.0000000000000000"
"345583"	"3.5000000000000000"
"345574"	"5.0000000000000000"
"345580"	"4.6666666666666667"
"345588"	"4.0000000000000000"
"345571"	"2.5000000000000000"
"345587"	"3.0000000000000000"
"345573"	"4.5000000000000000"
"345569"	"3.5000000000000000"
"345577"	"4.5000000000000000"
"345568"	"3.5000000000000000"
"345582"	"3.5000000000000000"
"345585"	"2.5000000000000000"
"345578"	"2.5000000000000000"

### Запрос 8: Вывести минимальный и максимальный баллы, полученные студентами на экзаменах:
`SELECT MAX(Grade), MIN(Grade) FROM EXAM_RESULT;`
### Результат запроса 8
max "5"
min "2"

# Объединение и пересечение
### Запрос 9: Найти пересечение идентификаторов студентов, получавших и 2, и 5. Каждый идентификатор из пересечения должен встречаться не более одного раза:
`SELECT StudentId FROM EXAM_RESULT WHERE Grade = 2
INTERSECT
SELECT StudentId FROM EXAM_RESULT WHERE Grade = 5;`
### Результат запроса 9
"345569"
"345583"
"345576"

### Запрос 10: Найти объединение идентификаторов студентов, у которых есть хоть одна 2 и/или хоть одна 5. Каждый идентификатор из пересечения должен встречаться не более одного раза:
`SELECT StudentId FROM EXAM_RESULT WHERE Grade = 2
INTERSECT
SELECT StudentId FROM EXAM_RESULT WHERE Grade = 5;`
### Результат запроса 10
"345567"
"345569"
"345570"
"345571"
"345572"
"345573"
"345574"
"345576"
"345577"
"345578"
"345579"
"345580"
"345581"
"345583"
"345584"
"345585"
"345586"
